In [2]:
import numpy as np 
import pandas as pd

**Pivot Tables**

In [3]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    403     53   John  January      Q1
1  2023-01-02       B   West    666     51   Mary  January      Q1
2  2023-01-03       C  North    907     13    Bob  January      Q1
3  2023-01-04       D  South    365     77  Alice  January      Q1
4  2023-01-05       A   East    355     99   John  January      Q1
5  2023-01-06       B   West    130     58   Mary  January      Q1
6  2023-01-07       C  North    437     80    Bob  January      Q1
7  2023-01-08       D  South    754     78  Alice  January      Q1
8  2023-01-09       A   East    554     35   John  January      Q1
9  2023-01-10       B   West    402     51   Mary  January      Q1
10 2023-01-11       C  North    338     31    Bob  January      Q1
11 2023-01-12       D  South    983     40  Alice  January      Q1
12 2023-01-13       A   East    387     49   John  January      Q1
13 2023-01-14       B   West    553     45   Mary  January      Q1
14 2023-01-15       C  North    693     15    Bob  January      Q1
15 2023-01-16       D  South    662     71  Alice  January      Q1
16 2023-01-17       A   East    447     68   John  January      Q1
17 2023-01-18       B   West    888     12   Mary  January      Q1
18 2023-01-19       C  North    115     55    Bob  January      Q1
19 2023-01-20       D  South    399     48  Alice  January      Q1

In [16]:
l=df['Product'].nunique()
l

4

In [13]:

gb=df.groupby('Product')
for i in gb:
    print(i)

('A',          Date Product Region  Sales  Units   Rep    Month Quarter
0  2023-01-01       A   East    403     53  John  January      Q1
4  2023-01-05       A   East    355     99  John  January      Q1
8  2023-01-09       A   East    554     35  John  January      Q1
12 2023-01-13       A   East    387     49  John  January      Q1
16 2023-01-17       A   East    447     68  John  January      Q1)
('B',          Date Product Region  Sales  Units   Rep    Month Quarter
1  2023-01-02       B   West    666     51  Mary  January      Q1
5  2023-01-06       B   West    130     58  Mary  January      Q1
9  2023-01-10       B   West    402     51  Mary  January      Q1
13 2023-01-14       B   West    553     45  Mary  January      Q1
17 2023-01-18       B   West    888     12  Mary  January      Q1)
('C',          Date Product Region  Sales  Units  Rep    Month Quarter
2  2023-01-03       C  North    907     13  Bob  January      Q1
6  2023-01-07       C  North    437     80  Bob  January      Q1
10 2023-01-11       C  North    338     31  Bob  January      Q1
14 2023-01-15       C  North    693     15  Bob  January      Q1
18 2023-01-19       C  North    115     55  Bob  January      Q1)
('D',          Date Product Region  Sales  Units    Rep    Month Quarter
3  2023-01-04       D  South    365     77  Alice  January      Q1
7  2023-01-08       D  South    754     78  Alice  January      Q1
11 2023-01-12       D  South    983     40  Alice  January      Q1
15 2023-01-16       D  South    662     71  Alice  January      Q1
19 2023-01-20       D  South    399     48  Alice  January      Q1)

In [19]:
pd.pivot_table(df,values = "Sales",index = 'Region',columns="Product",aggfunc = 'median')

Product      A      B      C      D
Region
East     403.0    NaN    NaN    NaN
North      NaN    NaN  437.0    NaN
South      NaN    NaN    NaN  662.0
West       NaN  553.0    NaN    NaN

In [45]:
pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     474.2    NaN    NaN    NaN  38.6   NaN   NaN   NaN
North      NaN    NaN  617.0    NaN   NaN   NaN  42.0   NaN
South      NaN    NaN    NaN  485.0   NaN   NaN   NaN  64.4
West       NaN  527.2    NaN    NaN   NaN  63.6   NaN   NaN

In [21]:
pivot3 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns=['Product','Rep'],fill_value=0)
pivot3

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Rep       John   Mary    Bob  Alice  John  Mary   Bob Alice
Region
East     429.2    0.0    0.0    0.0  60.8   0.0   0.0   0.0
North      0.0    0.0  498.0    0.0   0.0   0.0  38.8   0.0
South      0.0    0.0    0.0  632.6   0.0   0.0   0.0  62.8
West       0.0  527.8    0.0    0.0   0.0  43.4   0.0   0.0

**Cross Tabs**

In [49]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0